///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитФормыВЗначение("Объект").НастройкиПоУмолчанию());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПростыеДублиИспользованиеПриИзменении(Элемент)
	Элементы.ГруппаПростыеДубли.Доступность = ПростыеДублиИспользование;
КонецПроцедуры

&НаКлиенте
Процедура РегистрыСведенийИспользованиеПриИзменении(Элемент)
	Элементы.ГруппаРегистрыСведений.Доступность = РегистрыСведенийИспользование;
КонецПроцедуры

&НаКлиенте
Процедура РегистрыНакопленияИспользованиеПриИзменении(Элемент)
	Элементы.ГруппаРегистрыНакопления.Доступность = РегистрыНакопленияИспользование;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПускСКонтролем(Команда)
	ПроверятьЗаполнение = Истина;
	ПускНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПускБезКонтроля(Команда)
	ПроверятьЗаполнение = Ложь;
	ПускНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПускНаКлиенте()
	
	ПускНаСервере();
	
	ОповеститьОбИзменении(Тип("СправочникСсылка._ДемоНоменклатура"));
	Если РегистрыСведенийИспользование Тогда
		ОповеститьОбИзменении(Тип("СправочникСсылка._ДемоОрганизации"));
		ОповеститьОбИзменении(Тип("СправочникСсылка._ДемоПодразделения"));
		ОповеститьОбИзменении(Тип("СправочникСсылка.Пользователи"));
	КонецЕсли;
	
	Если ПростыеДублиИспользование Или РегистрыНакопленияИспользование Тогда
		ПараметрыФормы = Новый Структура("ОбластьПоискаДублей", "Справочник._ДемоНоменклатура");
		ОткрытьФорму("Обработка.ПоискИУдалениеДублей.Форма.ПоискДублей",
			ПараметрыФормы, , Истина, , , , РежимБлокировкиПриОткрытииОкнаФормы.НеБлокировать);
	КонецЕсли;
	
	Если РегистрыСведенийИспользование Тогда
		ПараметрыФормы = Новый Структура("ОбластьПоискаДублей", "Справочник._ДемоФизическиеЛица");
		ОткрытьФорму("Обработка.ПоискИУдалениеДублей.Форма.ПоискДублей",
			ПараметрыФормы, , Истина, , , , РежимБлокировкиПриОткрытииОкнаФормы.НеБлокировать);
		
		ПараметрыФормы = Новый Структура("ОбластьПоискаДублей", "Справочник.Пользователи");
		ОткрытьФорму("Обработка.ПоискИУдалениеДублей.Форма.ПоискДублей",
			ПараметрыФормы, , Истина, , , , РежимБлокировкиПриОткрытииОкнаФормы.НеБлокировать);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПускНаСервере()
	РеквизитФормыВЗначение("Объект").Сгенерировать(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти
