///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверка, что форма открыта с нужными параметрами
	Если Не ЗначениеЗаполнено(Параметры.АдресТаблицы) Тогда
		ВызватьИсключение НСтр("ru = 'Эта форма не предназначена для непосредственного открытия.'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	СписокСкладов.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресТаблицы));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьОтбор(Команда)
	
	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("АдресТаблицы", СформироватьТаблицуВыбранныхСкладов());
	
	Закрыть(РезультатВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьТаблицуВыбранныхСкладов()

	Возврат ПоместитьВоВременноеХранилище(СписокСкладов.Выгрузить(), УникальныйИдентификатор);

КонецФункции

#КонецОбласти


