///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		СтандартныеПодсистемыСервер.ПереместитьЭлементыВГруппу(Элементы.Список.КоманднаяПанель, КоманднаяПанель);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаменитьВоВсехМестахИспользования(Команда)
	
	ДоговорыДляЗамены = Элементы.Список.ПолучитьСтрокиДляОбработки();
	
	Если ДоговорыДляЗамены.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите договор'"));
		Возврат;
	КонецЕсли;
	
	ПоискИУдалениеДублейКлиент.ЗаменитьВыделенные(ДоговорыДляЗамены);
	
КонецПроцедуры

#КонецОбласти